artisdom/xiaozhi-esp32/main/display/lvgl_display/file_viewer.cc
#include "file_viewer.h"
#include <font_awesome.h>
#include <esp_log.h>
#include <esp_err.h>
#include <esp_heap_caps.h>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <sys/stat.h>
#include <algorithm>

#include "application.h"
#include "board.h"

#ifndef CONFIG_IDF_TARGET_ESP32
#include "jpg/jpeg_to_image.h"
#endif

// MP3/WAV audio player support for ESP32-S3 and ESP32-P4
#if defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32P4)
#define AUDIO_PLAYER_SUPPORTED 1
#include <audio_player.h>
#endif

static const char* TAG = "FileViewer";

// Maximum file size to load (64KB for text files)
#define MAX_TEXT_FILE_SIZE (64 * 1024)
// Maximum image file size (2MB)
#define MAX_IMAGE_FILE_SIZE (2 * 1024 * 1024)
// Maximum audio file size for OGG (4MB)
#define MAX_AUDIO_FILE_SIZE (4 * 1024 * 1024)

//=============================================================================
// FileViewer base class
//=============================================================================

FileViewer::FileViewer() {}

FileViewer::~FileViewer() {
    if (container_) {
        lv_obj_delete(container_);
        container_ = nullptr;
    }
}

void FileViewer::Init(lv_obj_t* parent) {
    if (container_) return;
    if (parent == nullptr) {
        parent = lv_screen_active();
    }
    CreateBaseUI(parent);
}

void FileViewer::CreateBaseUI(lv_obj_t* parent) {
    // Main container overlay
    container_ = lv_obj_create(parent);
    lv_obj_set_size(container_, LV_HOR_RES, LV_VER_RES);
    lv_obj_align(container_, LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_bg_color(container_, lv_color_hex(0x1a1a2e), 0);
    lv_obj_set_style_bg_opa(container_, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(container_, 0, 0);
    lv_obj_set_style_border_width(container_, 0, 0);
    lv_obj_set_style_pad_all(container_, 0, 0);
    lv_obj_add_flag(container_, LV_OBJ_FLAG_HIDDEN);

    // Title bar
    title_bar_ = lv_obj_create(container_);
    lv_obj_set_size(title_bar_, LV_HOR_RES, 60);
    lv_obj_align(title_bar_, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_bg_color(title_bar_, lv_color_hex(0x16213e), 0);
    lv_obj_set_style_bg_opa(title_bar_, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(title_bar_, 0, 0);
    lv_obj_set_style_border_width(title_bar_, 0, 0);
    lv_obj_set_style_pad_all(title_bar_, 8, 0);
    lv_obj_clear_flag(title_bar_, LV_OBJ_FLAG_SCROLLABLE);

    // Title label
    title_label_ = lv_label_create(title_bar_);
    lv_obj_set_width(title_label_, LV_HOR_RES - 80);
    lv_label_set_long_mode(title_label_, LV_LABEL_LONG_DOT);
    lv_obj_align(title_label_, LV_ALIGN_LEFT_MID, 8, 0);
    lv_obj_set_style_text_color(title_label_, lv_color_white(), 0);
    lv_label_set_text(title_label_, "File Viewer");

    // Close button
    close_btn_ = lv_btn_create(title_bar_);
    lv_obj_set_size(close_btn_, 50, 44);
    lv_obj_align(close_btn_, LV_ALIGN_RIGHT_MID, 0, 0);
    lv_obj_set_style_bg_color(close_btn_, lv_color_hex(0xe94560), 0);
    lv_obj_set_style_radius(close_btn_, 8, 0);
    lv_obj_add_event_cb(close_btn_, OnCloseButtonClicked, LV_EVENT_CLICKED, this);
    
    lv_obj_t* close_label = lv_label_create(close_btn_);
    lv_label_set_text(close_label, FONT_AWESOME_XMARK);
    lv_obj_center(close_label);
    lv_obj_set_style_text_color(close_label, lv_color_white(), 0);

    // Content area
    content_area_ = lv_obj_create(container_);
    lv_obj_set_size(content_area_, LV_HOR_RES, LV_VER_RES - 60);
    lv_obj_align(content_area_, LV_ALIGN_TOP_MID, 0, 60);
    lv_obj_set_style_bg_color(content_area_, lv_color_hex(0x0f0f1a), 0);
    lv_obj_set_style_bg_opa(content_area_, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(content_area_, 0, 0);
    lv_obj_set_style_pad_all(content_area_, 16, 0);
}

void FileViewer::Close() {
    if (container_) {
        lv_obj_add_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = false;
    }
    
    if (close_callback_) {
        close_callback_();
    }
}

void FileViewer::OnCloseButtonClicked(lv_event_t* e) {
    FileViewer* viewer = static_cast<FileViewer*>(lv_event_get_user_data(e));
    viewer->Close();
}

//=============================================================================
// TextFileViewer
//=============================================================================

TextFileViewer::TextFileViewer() {}

TextFileViewer::~TextFileViewer() {
    FreeContent();
}

void TextFileViewer::Init(lv_obj_t* parent) {
    FileViewer::Init(parent);
    
    // Setup text label in content area
    text_label_ = lv_label_create(content_area_);
    lv_obj_set_width(text_label_, LV_HOR_RES - 48);
    lv_label_set_long_mode(text_label_, LV_LABEL_LONG_WRAP);
    lv_obj_align(text_label_, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_text_color(text_label_, lv_color_hex(0xe0e0e0), 0);
    lv_label_set_text(text_label_, "");
    
    // Enable scrolling in content area
    lv_obj_set_scrollbar_mode(content_area_, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_scroll_dir(content_area_, LV_DIR_VER);
    
    ESP_LOGI(TAG, "TextFileViewer initialized");
}

void TextFileViewer::FreeContent() {
    if (file_content_) {
        free(file_content_);
        file_content_ = nullptr;
    }
}

bool TextFileViewer::Open(const std::string& path) {
    FreeContent();
    current_file_ = path;
    
    // Get file size
    struct stat st;
    if (stat(path.c_str(), &st) != 0) {
        ESP_LOGE(TAG, "Failed to stat file: %s", path.c_str());
        return false;
    }
    
    size_t file_size = st.st_size;
    if (file_size > MAX_TEXT_FILE_SIZE) {
        ESP_LOGW(TAG, "File too large (%zu bytes), truncating to %d", file_size, MAX_TEXT_FILE_SIZE);
        file_size = MAX_TEXT_FILE_SIZE;
    }
    
    // Allocate buffer
    file_content_ = (char*)malloc(file_size + 1);
    if (!file_content_) {
        ESP_LOGE(TAG, "Failed to allocate %zu bytes for file content", file_size + 1);
        return false;
    }
    
    // Read file
    FILE* f = fopen(path.c_str(), "r");
    if (!f) {
        ESP_LOGE(TAG, "Failed to open file: %s", path.c_str());
        FreeContent();
        return false;
    }
    
