artisdom/xiaozhi-esp32/main/display/lvgl_display/file_viewer.cc
    size_t bytes_read = fread(file_content_, 1, file_size, f);
    fclose(f);
    
    file_content_[bytes_read] = '\0';
    
    // Update UI
    // Extract filename from path
    const char* filename = strrchr(path.c_str(), '/');
    filename = filename ? filename + 1 : path.c_str();
    lv_label_set_text(title_label_, filename);
    
    lv_label_set_text(text_label_, file_content_);
    
    // Show viewer
    lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(container_);
    is_visible_ = true;
    
    // Scroll to top
    lv_obj_scroll_to_y(content_area_, 0, LV_ANIM_OFF);
    
    ESP_LOGI(TAG, "Opened text file: %s (%zu bytes)", path.c_str(), bytes_read);
    return true;
}

void TextFileViewer::Close() {
    FreeContent();
    FileViewer::Close();
}

//=============================================================================
// ImageViewer
//=============================================================================

ImageViewer::ImageViewer() {}

ImageViewer::~ImageViewer() {
    FreeImageData();
}

void ImageViewer::Init(lv_obj_t* parent) {
    FileViewer::Init(parent);
    
    // Center content area setup
    lv_obj_set_style_bg_color(content_area_, lv_color_hex(0x000000), 0);
    lv_obj_clear_flag(content_area_, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_flex_flow(content_area_, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(content_area_, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    
    // Image object
    image_obj_ = lv_image_create(content_area_);
    lv_obj_center(image_obj_);
    
    // Enable gesture detection on content area
    lv_obj_add_flag(content_area_, LV_OBJ_FLAG_GESTURE_BUBBLE);
    lv_obj_add_event_cb(content_area_, OnSwipeEvent, LV_EVENT_GESTURE, this);
    
    // Previous button (left side)
    prev_btn_ = lv_btn_create(container_);
    lv_obj_set_size(prev_btn_, 50, 80);
    lv_obj_align(prev_btn_, LV_ALIGN_LEFT_MID, 8, 0);
    lv_obj_set_style_bg_color(prev_btn_, lv_color_hex(0x0f3460), 0);
    lv_obj_set_style_bg_opa(prev_btn_, LV_OPA_70, 0);
    lv_obj_set_style_radius(prev_btn_, 8, 0);
    lv_obj_add_event_cb(prev_btn_, OnPrevButtonClicked, LV_EVENT_CLICKED, this);
    
    lv_obj_t* prev_label = lv_label_create(prev_btn_);
    lv_label_set_text(prev_label, LV_SYMBOL_LEFT);
    lv_obj_center(prev_label);
    lv_obj_set_style_text_color(prev_label, lv_color_white(), 0);
    
    // Next button (right side)
    next_btn_ = lv_btn_create(container_);
    lv_obj_set_size(next_btn_, 50, 80);
    lv_obj_align(next_btn_, LV_ALIGN_RIGHT_MID, -8, 0);
    lv_obj_set_style_bg_color(next_btn_, lv_color_hex(0x0f3460), 0);
    lv_obj_set_style_bg_opa(next_btn_, LV_OPA_70, 0);
    lv_obj_set_style_radius(next_btn_, 8, 0);
    lv_obj_add_event_cb(next_btn_, OnNextButtonClicked, LV_EVENT_CLICKED, this);
    
    lv_obj_t* next_label = lv_label_create(next_btn_);
    lv_label_set_text(next_label, LV_SYMBOL_RIGHT);
    lv_obj_center(next_label);
    lv_obj_set_style_text_color(next_label, lv_color_white(), 0);
    
    // Navigation counter label (e.g., "3/10")
    nav_label_ = lv_label_create(title_bar_);
    lv_obj_align(nav_label_, LV_ALIGN_RIGHT_MID, -60, 0);
    lv_obj_set_style_text_color(nav_label_, lv_color_hex(0xaaaaaa), 0);
    lv_label_set_text(nav_label_, "");
    
    ESP_LOGI(TAG, "ImageViewer initialized with swipe support");
}

void ImageViewer::FreeImageData() {
    if (image_data_) {
        heap_caps_free(image_data_);
        image_data_ = nullptr;
    }
    memset(&image_dsc_, 0, sizeof(image_dsc_));
}

void ImageViewer::ShowError(const char* message) {
    if (!error_label_) {
        error_label_ = lv_label_create(content_area_);
        lv_obj_set_style_text_color(error_label_, lv_color_hex(0xff6666), 0);
        lv_obj_center(error_label_);
    }
    lv_label_set_text(error_label_, message);
    lv_obj_clear_flag(error_label_, LV_OBJ_FLAG_HIDDEN);
}

bool ImageViewer::Open(const std::string& path) {
    FreeImageData();
    current_file_ = path;
    
    // Hide any previous error
    if (error_label_) {
        lv_obj_add_flag(error_label_, LV_OBJ_FLAG_HIDDEN);
    }
    
    // Extract filename from path
    const char* filename = strrchr(path.c_str(), '/');
    filename = filename ? filename + 1 : path.c_str();
    lv_label_set_text(title_label_, filename);
    
    // Check file size
    struct stat st;
    if (stat(path.c_str(), &st) != 0) {
        ESP_LOGE(TAG, "Failed to stat image file: %s", path.c_str());
        ShowError("Failed to access file");
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }
    
    if (st.st_size > MAX_IMAGE_FILE_SIZE) {
        ESP_LOGE(TAG, "Image file too large: %ld bytes", st.st_size);
        ShowError("Image file too large\n(max 2MB)");
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }

#ifndef CONFIG_IDF_TARGET_ESP32
    // Read the file
    FILE* f = fopen(path.c_str(), "rb");
    if (!f) {
        ESP_LOGE(TAG, "Failed to open image file: %s", path.c_str());
        ShowError("Failed to open file");
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }
    
    // Allocate buffer for file data
    uint8_t* file_data = (uint8_t*)heap_caps_malloc(st.st_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!file_data) {
        file_data = (uint8_t*)malloc(st.st_size);
    }
    if (!file_data) {
        ESP_LOGE(TAG, "Failed to allocate memory for file: %zu bytes", (size_t)st.st_size);
        fclose(f);
        ShowError("Out of memory");
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }
    
    size_t read_len = fread(file_data, 1, st.st_size, f);
    fclose(f);
    
    if (read_len != (size_t)st.st_size) {
        ESP_LOGE(TAG, "Failed to read file: got %zu, expected %zu", read_len, (size_t)st.st_size);
        heap_caps_free(file_data);
        ShowError("Failed to read file");
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }
    
    // Decode JPEG
    size_t out_len = 0, width = 0, height = 0, stride = 0;
    esp_err_t ret = jpeg_to_image(file_data, read_len, &image_data_, &out_len, &width, &height, &stride);
    heap_caps_free(file_data);  // Free the source file data
    
    if (ret != ESP_OK || !image_data_) {
        ESP_LOGE(TAG, "Failed to decode image: %s (err=%d)", path.c_str(), ret);
        if (ret == ESP_ERR_NOT_SUPPORTED) {
            ShowError("Progressive JPEG\nnot supported");
        } else {
            ShowError("Failed to decode image\nFormat not supported");
        }
        lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
        is_visible_ = true;
        return false;
    }
    
    ESP_LOGI(TAG, "Decoded image: %zux%zu, stride=%zu, size=%zu", width, height, stride, out_len);
    
