artisdom/xiaozhi-esp32/main/display/lvgl_display/file_viewer.cc
    // Setup LVGL image descriptor
    image_dsc_.header.magic = LV_IMAGE_HEADER_MAGIC;
    image_dsc_.header.cf = LV_COLOR_FORMAT_RGB565;
    image_dsc_.header.w = width;
    image_dsc_.header.h = height;
    image_dsc_.header.stride = stride;
    image_dsc_.data_size = out_len;
    image_dsc_.data = image_data_;
    
    // Set image source
    lv_image_set_src(image_obj_, &image_dsc_);
    
    // Scale to fit screen while maintaining aspect ratio
    int32_t max_w = LV_HOR_RES - 32;
    int32_t max_h = LV_VER_RES - 60 - 32;  // Account for title bar and padding
    
    if ((int32_t)width > max_w || (int32_t)height > max_h) {
        float scale_w = (float)max_w / width;
        float scale_h = (float)max_h / height;
        float scale = (scale_w < scale_h) ? scale_w : scale_h;
        lv_image_set_scale(image_obj_, (uint32_t)(scale * 256));
    } else {
        lv_image_set_scale(image_obj_, 256);  // 1:1 scale
    }
#else
    ShowError("Image viewing not supported\non this platform");
#endif
    
    // Find current index in image list
    current_index_ = -1;
    for (size_t i = 0; i < image_list_.size(); i++) {
        if (image_list_[i] == path) {
            current_index_ = (int)i;
            break;
        }
    }
    UpdateNavUI();
    
    // Show viewer
    lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(container_);
    is_visible_ = true;
    
    ESP_LOGI(TAG, "Opened image: %s (%d/%zu)", path.c_str(), current_index_ + 1, image_list_.size());
    return true;
}

void ImageViewer::Close() {
    FreeImageData();
    lv_image_set_src(image_obj_, NULL);
    image_list_.clear();
    current_index_ = -1;
    FileViewer::Close();
}

void ImageViewer::SetImageList(const std::vector<std::string>& images) {
    image_list_ = images;
    current_index_ = -1;
    UpdateNavUI();
}

void ImageViewer::NavigatePrev() {
    if (image_list_.empty() || current_index_ <= 0) {
        return;
    }
    
    int new_index = current_index_ - 1;
    const std::string& new_path = image_list_[new_index];
    
    if (navigate_callback_) {
        navigate_callback_(new_path);
    } else {
        Open(new_path);
    }
}

void ImageViewer::NavigateNext() {
    if (image_list_.empty() || current_index_ < 0 || 
        current_index_ >= (int)image_list_.size() - 1) {
        return;
    }
    
    int new_index = current_index_ + 1;
    const std::string& new_path = image_list_[new_index];
    
    if (navigate_callback_) {
        navigate_callback_(new_path);
    } else {
        Open(new_path);
    }
}

void ImageViewer::UpdateNavUI() {
    bool has_list = !image_list_.empty() && current_index_ >= 0;
    
    // Update navigation buttons visibility
    if (prev_btn_) {
        if (has_list && current_index_ > 0) {
            lv_obj_clear_flag(prev_btn_, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(prev_btn_, LV_OBJ_FLAG_HIDDEN);
        }
    }
    
    if (next_btn_) {
        if (has_list && current_index_ < (int)image_list_.size() - 1) {
            lv_obj_clear_flag(next_btn_, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(next_btn_, LV_OBJ_FLAG_HIDDEN);
        }
    }
    
    // Update counter label
    if (nav_label_) {
        if (has_list && image_list_.size() > 1) {
            char buf[32];
            snprintf(buf, sizeof(buf), "%d/%zu", current_index_ + 1, image_list_.size());
            lv_label_set_text(nav_label_, buf);
        } else {
            lv_label_set_text(nav_label_, "");
        }
    }
}

void ImageViewer::OnSwipeEvent(lv_event_t* e) {
    ImageViewer* viewer = static_cast<ImageViewer*>(lv_event_get_user_data(e));
    lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_active());
    
    if (dir == LV_DIR_LEFT) {
        // Swipe left -> next image
        viewer->NavigateNext();
    } else if (dir == LV_DIR_RIGHT) {
        // Swipe right -> previous image
        viewer->NavigatePrev();
    }
}

void ImageViewer::OnPrevButtonClicked(lv_event_t* e) {
    ImageViewer* viewer = static_cast<ImageViewer*>(lv_event_get_user_data(e));
    viewer->NavigatePrev();
}

void ImageViewer::OnNextButtonClicked(lv_event_t* e) {
    ImageViewer* viewer = static_cast<ImageViewer*>(lv_event_get_user_data(e));
    viewer->NavigateNext();
}

//=============================================================================
// AudioPlayer
//=============================================================================

// Audio player callback and state for MP3/WAV playback
#ifdef AUDIO_PLAYER_SUPPORTED
static AudioPlayer* g_current_audio_player = nullptr;
static bool g_audio_player_initialized = false;

static esp_err_t audio_mute_function(AUDIO_PLAYER_MUTE_SETTING setting) {
    auto codec = Board::GetInstance().GetAudioCodec();
    if (codec) {
        codec->EnableOutput(setting == AUDIO_PLAYER_UNMUTE);
    }
    return ESP_OK;
}

static void audio_player_event_callback(audio_player_cb_ctx_t* ctx) {
    ESP_LOGI(TAG, "Audio player event: %d", (int)ctx->audio_event);
    
    audio_player_state_t state = audio_player_get_state();
    if (state == AUDIO_PLAYER_STATE_IDLE && g_current_audio_player) {
        // Playback finished
        g_current_audio_player->is_playing_ = false;
        ESP_LOGI(TAG, "Audio playback completed");
    }
}

// I2S write wrapper for esp-audio-player
static esp_err_t audio_i2s_write(void* data, size_t size, size_t* bytes_written, uint32_t timeout_ms) {
    auto codec = Board::GetInstance().GetAudioCodec();
    if (codec && codec->output_enabled()) {
        // Convert raw bytes to int16_t samples and use public OutputData method
        int samples = size / sizeof(int16_t);
        std::vector<int16_t> audio_buffer((int16_t*)data, (int16_t*)data + samples);
        codec->OutputData(audio_buffer);
        *bytes_written = size;
        return ESP_OK;
    }
    *bytes_written = 0;
    return ESP_FAIL;
}

// I2S clock reconfiguration wrapper
static esp_err_t audio_i2s_reconfig_clk(uint32_t rate, uint32_t bits_cfg, i2s_slot_mode_t ch) {
    // The AudioCodec handles sample rate internally, just return OK
    ESP_LOGI(TAG, "Audio player requested clock: rate=%lu, bits=%lu, ch=%d", rate, bits_cfg, (int)ch);
    return ESP_OK;
}
#endif

AudioPlayer::AudioPlayer() {}

AudioPlayer::~AudioPlayer() {
    audio_data_.clear();
#ifdef AUDIO_PLAYER_SUPPORTED
    if (audio_file_) {
        fclose(audio_file_);
        audio_file_ = nullptr;
    }
    if (g_current_audio_player == this) {
        g_current_audio_player = nullptr;
    }
#endif
}

void AudioPlayer::Init(lv_obj_t* parent) {
    FileViewer::Init(parent);
    
