artisdom/xiaozhi-esp32/main/display/lvgl_display/file_viewer.cc
    // Center content setup
    lv_obj_clear_flag(content_area_, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_flex_flow(content_area_, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(content_area_, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_row(content_area_, 20, 0);
    
    // File info icon
    lv_obj_t* icon = lv_label_create(content_area_);
    lv_label_set_text(icon, FONT_AWESOME_MUSIC);
    lv_obj_set_style_text_color(icon, lv_color_hex(0xffa500), 0);
    
    // File info label
    file_info_label_ = lv_label_create(content_area_);
    lv_obj_set_width(file_info_label_, LV_HOR_RES - 100);
    lv_label_set_long_mode(file_info_label_, LV_LABEL_LONG_DOT);
    lv_obj_set_style_text_align(file_info_label_, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(file_info_label_, lv_color_white(), 0);
    lv_label_set_text(file_info_label_, "");
    
    // Progress bar
    progress_bar_ = lv_bar_create(content_area_);
    lv_obj_set_size(progress_bar_, LV_HOR_RES - 100, 8);
    lv_bar_set_value(progress_bar_, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(progress_bar_, lv_color_hex(0x333333), LV_PART_MAIN);
    lv_obj_set_style_bg_color(progress_bar_, lv_color_hex(0xffa500), LV_PART_INDICATOR);
    
    // Time label
    time_label_ = lv_label_create(content_area_);
    lv_obj_set_style_text_color(time_label_, lv_color_hex(0x888888), 0);
    lv_label_set_text(time_label_, "");
    
    // Control buttons container
    lv_obj_t* btn_container = lv_obj_create(content_area_);
    lv_obj_set_size(btn_container, 200, 60);
    lv_obj_set_style_bg_opa(btn_container, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(btn_container, 0, 0);
    lv_obj_set_style_pad_all(btn_container, 0, 0);
    lv_obj_set_flex_flow(btn_container, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(btn_container, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_column(btn_container, 20, 0);
    
    // Play button
    play_btn_ = lv_btn_create(btn_container);
    lv_obj_set_size(play_btn_, 60, 60);
    lv_obj_set_style_bg_color(play_btn_, lv_color_hex(0x4caf50), 0);
    lv_obj_set_style_radius(play_btn_, 30, 0);
    lv_obj_add_event_cb(play_btn_, OnPlayButtonClicked, LV_EVENT_CLICKED, this);
    
    lv_obj_t* play_label = lv_label_create(play_btn_);
    lv_label_set_text(play_label, FONT_AWESOME_PLAY);
    lv_obj_center(play_label);
    lv_obj_set_style_text_color(play_label, lv_color_white(), 0);
    
    // Stop button
    stop_btn_ = lv_btn_create(btn_container);
    lv_obj_set_size(stop_btn_, 60, 60);
    lv_obj_set_style_bg_color(stop_btn_, lv_color_hex(0xf44336), 0);
    lv_obj_set_style_radius(stop_btn_, 30, 0);
    lv_obj_add_event_cb(stop_btn_, OnStopButtonClicked, LV_EVENT_CLICKED, this);
    
    lv_obj_t* stop_label = lv_label_create(stop_btn_);
    lv_label_set_text(stop_label, FONT_AWESOME_STOP);
    lv_obj_center(stop_label);
    lv_obj_set_style_text_color(stop_label, lv_color_white(), 0);
    
    // Info message label
    info_label_ = lv_label_create(content_area_);
    lv_obj_set_width(info_label_, LV_HOR_RES - 60);
    lv_obj_set_style_text_align(info_label_, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(info_label_, lv_color_hex(0x666666), 0);
    lv_label_set_text(info_label_, "");
    
    ESP_LOGI(TAG, "AudioPlayer initialized");
}

void AudioPlayer::SetInfoMessage(const char* msg, lv_color_t color) {
    if (info_label_) {
        lv_label_set_text(info_label_, msg);
        lv_obj_set_style_text_color(info_label_, color, 0);
    }
}

AudioFormat AudioPlayer::DetectAudioFormat(const std::string& filename) {
    std::string name_lower = filename;
    std::transform(name_lower.begin(), name_lower.end(), name_lower.begin(), ::tolower);
    
    if (name_lower.size() >= 4) {
        std::string ext = name_lower.substr(name_lower.size() - 4);
        if (ext == ".ogg") return AudioFormat::kOgg;
        if (ext == ".mp3") return AudioFormat::kMp3;
        if (ext == ".wav") return AudioFormat::kWav;
    }
    return AudioFormat::kUnknown;
}

const char* AudioPlayer::GetFormatName(AudioFormat format) {
    switch (format) {
        case AudioFormat::kOgg: return "OGG";
        case AudioFormat::kMp3: return "MP3";
        case AudioFormat::kWav: return "WAV";
        default: return "Unknown";
    }
}

bool AudioPlayer::PlayOggFile() {
    if (audio_data_.empty()) {
        SetInfoMessage("No audio data loaded", lv_color_hex(0xff6666));
        return false;
    }
    
    auto& app = Application::GetInstance();
    std::string_view audio_view(reinterpret_cast<const char*>(audio_data_.data()), audio_data_.size());
    app.GetAudioService().PlaySound(audio_view);
    
    SetInfoMessage("Playing...", lv_color_hex(0x4caf50));
    is_playing_ = true;
    lv_bar_set_value(progress_bar_, 100, LV_ANIM_ON);
    
    ESP_LOGI(TAG, "Playing OGG file: %zu bytes", audio_data_.size());
    return true;
}

bool AudioPlayer::PlayMp3WavFile() {
#ifdef AUDIO_PLAYER_SUPPORTED
    if (!audio_file_) {
        SetInfoMessage("No audio file loaded", lv_color_hex(0xff6666));
        return false;
    }
    
    // Initialize audio player if not already done
    if (!g_audio_player_initialized) {
        audio_player_config_t config = {
            .mute_fn = audio_mute_function,
            .clk_set_fn = audio_i2s_reconfig_clk,
            .write_fn = audio_i2s_write,
            .priority = 5,
            .coreID = 1,
        };
        
        esp_err_t ret = audio_player_new(config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to create audio player: %s", esp_err_to_name(ret));
            SetInfoMessage("Audio player init failed", lv_color_hex(0xff6666));
            return false;
        }
        
        audio_player_callback_register(audio_player_event_callback, NULL);
        g_audio_player_initialized = true;
        ESP_LOGI(TAG, "Audio player initialized");
    }
    
    // Reset file position to beginning
    fseek(audio_file_, 0, SEEK_SET);
    
    g_current_audio_player = this;
    
    esp_err_t ret = audio_player_play(audio_file_);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start playback: %s", esp_err_to_name(ret));
        SetInfoMessage("Playback failed", lv_color_hex(0xff6666));
        return false;
    }
    
    SetInfoMessage("Playing...", lv_color_hex(0x4caf50));
    is_playing_ = true;
    lv_bar_set_value(progress_bar_, 100, LV_ANIM_ON);
    
    ESP_LOGI(TAG, "Started %s playback", GetFormatName(audio_format_));
    return true;
#else
    SetInfoMessage("MP3/WAV not supported\non this platform", lv_color_hex(0xff6666));
    return false;
#endif
}

void AudioPlayer::StopMp3WavFile() {
#ifdef AUDIO_PLAYER_SUPPORTED
    if (g_audio_player_initialized) {
        audio_player_stop();
        ESP_LOGI(TAG, "Stopped MP3/WAV playback");
    }
#endif
}

