artisdom/xiaozhi-esp32/main/display/lvgl_display/file_viewer.cc
bool AudioPlayer::Open(const std::string& path) {
    current_file_ = path;
    audio_data_.clear();
    audio_format_ = AudioFormat::kUnknown;
    is_playing_ = false;
    
#ifdef AUDIO_PLAYER_SUPPORTED
    // Close previous file if any
    if (audio_file_) {
        fclose(audio_file_);
        audio_file_ = nullptr;
    }
#endif
    
    // Extract filename
    const char* filename = strrchr(path.c_str(), '/');
    filename = filename ? filename + 1 : path.c_str();
    lv_label_set_text(title_label_, filename);
    lv_label_set_text(file_info_label_, filename);
    
    // Reset UI state
    lv_bar_set_value(progress_bar_, 0, LV_ANIM_OFF);
    lv_label_set_text(time_label_, "");
    
    // Detect format
    audio_format_ = DetectAudioFormat(filename);
    
    // Check file size
    struct stat st;
    if (stat(path.c_str(), &st) != 0) {
        SetInfoMessage("Failed to access file", lv_color_hex(0xff6666));
        goto show_and_return;
    }
    
    if (st.st_size > MAX_AUDIO_FILE_SIZE) {
        SetInfoMessage("File too large (max 4MB)", lv_color_hex(0xff6666));
        goto show_and_return;
    }
    
    if (audio_format_ == AudioFormat::kOgg) {
        // Read OGG file into memory for AudioService
        FILE* f = fopen(path.c_str(), "rb");
        if (!f) {
            SetInfoMessage("Failed to open file", lv_color_hex(0xff6666));
            goto show_and_return;
        }
        
        audio_data_.resize(st.st_size);
        size_t read_len = fread(audio_data_.data(), 1, st.st_size, f);
        fclose(f);
        
        if (read_len != (size_t)st.st_size) {
            audio_data_.clear();
            SetInfoMessage("Failed to read file", lv_color_hex(0xff6666));
            goto show_and_return;
        }
        
        ESP_LOGI(TAG, "Loaded OGG file: %s (%zu bytes)", path.c_str(), audio_data_.size());
    }
#ifdef AUDIO_PLAYER_SUPPORTED
    else if (audio_format_ == AudioFormat::kMp3 || audio_format_ == AudioFormat::kWav) {
        // Open file for streaming playback
        audio_file_ = fopen(path.c_str(), "rb");
        if (!audio_file_) {
            SetInfoMessage("Failed to open file", lv_color_hex(0xff6666));
            goto show_and_return;
        }
        
        ESP_LOGI(TAG, "Opened %s file: %s (%ld bytes)", GetFormatName(audio_format_), path.c_str(), st.st_size);
    }
#endif
    else {
        SetInfoMessage("Unsupported audio format", lv_color_hex(0xffaa00));
        goto show_and_return;
    }
    
    // Show file size info
    {
        char size_str[64];
        const char* fmt_name = GetFormatName(audio_format_);
        if (st.st_size < 1024) {
            snprintf(size_str, sizeof(size_str), "%s file - %ld bytes", fmt_name, st.st_size);
        } else if (st.st_size < 1024 * 1024) {
            snprintf(size_str, sizeof(size_str), "%s file - %.1f KB", fmt_name, st.st_size / 1024.0);
        } else {
            snprintf(size_str, sizeof(size_str), "%s file - %.1f MB", fmt_name, st.st_size / (1024.0 * 1024.0));
        }
        lv_label_set_text(time_label_, size_str);
        SetInfoMessage("Press play to start", lv_color_hex(0x4caf50));
    }
    
show_and_return:
    // Show player
    lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(container_);
    is_visible_ = true;
    
    bool file_ready = (audio_format_ == AudioFormat::kOgg && !audio_data_.empty());
#ifdef AUDIO_PLAYER_SUPPORTED
    file_ready = file_ready || ((audio_format_ == AudioFormat::kMp3 || audio_format_ == AudioFormat::kWav) && audio_file_ != nullptr);
#endif
    return file_ready;
}

void AudioPlayer::Close() {
    StopMp3WavFile();
    is_playing_ = false;
    audio_data_.clear();
    audio_format_ = AudioFormat::kUnknown;
    
#ifdef AUDIO_PLAYER_SUPPORTED
    if (audio_file_) {
        fclose(audio_file_);
        audio_file_ = nullptr;
    }
    if (g_current_audio_player == this) {
        g_current_audio_player = nullptr;
    }
#endif
    
    FileViewer::Close();
}

void AudioPlayer::OnPlayButtonClicked(lv_event_t* e) {
    AudioPlayer* player = static_cast<AudioPlayer*>(lv_event_get_user_data(e));
    
    if (player->audio_format_ == AudioFormat::kUnknown) {
        player->SetInfoMessage("Format not supported", lv_color_hex(0xff6666));
        return;
    }
    
    if (!player->is_playing_) {
        bool success = false;
        if (player->audio_format_ == AudioFormat::kOgg) {
            success = player->PlayOggFile();
        } else {
            success = player->PlayMp3WavFile();
        }
        if (!success) {
            ESP_LOGE(TAG, "Failed to start playback");
        }
    } else {
        // Audio is already playing
        player->SetInfoMessage("Audio is playing...", lv_color_hex(0x4caf50));
    }
}

void AudioPlayer::OnStopButtonClicked(lv_event_t* e) {
    AudioPlayer* player = static_cast<AudioPlayer*>(lv_event_get_user_data(e));
    
    if (player->audio_format_ == AudioFormat::kMp3 || player->audio_format_ == AudioFormat::kWav) {
        player->StopMp3WavFile();
    }
    
    player->is_playing_ = false;
    lv_bar_set_value(player->progress_bar_, 0, LV_ANIM_ON);
    player->SetInfoMessage("Stopped", lv_color_hex(0x888888));
    
    ESP_LOGI(TAG, "Playback stopped");
}

//=============================================================================
// VideoPlayer
//=============================================================================

VideoPlayer::VideoPlayer() {}

VideoPlayer::~VideoPlayer() {}

void VideoPlayer::Init(lv_obj_t* parent) {
    FileViewer::Init(parent);
    
    // Center content
    lv_obj_clear_flag(content_area_, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_flex_flow(content_area_, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(content_area_, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_row(content_area_, 20, 0);
    
    // Video icon
    lv_obj_t* icon = lv_label_create(content_area_);
    lv_label_set_text(icon, FONT_AWESOME_PLAY);
    lv_obj_set_style_text_color(icon, lv_color_hex(0xff6347), 0);
    
    // Info label
    info_label_ = lv_label_create(content_area_);
    lv_obj_set_width(info_label_, LV_HOR_RES - 100);
    lv_obj_set_style_text_align(info_label_, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(info_label_, lv_color_white(), 0);
    lv_label_set_text(info_label_, "");
    
    // Limitation message
    lv_obj_t* msg = lv_label_create(content_area_);
    lv_obj_set_width(msg, LV_HOR_RES - 60);
    lv_obj_set_style_text_align(msg, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(msg, lv_color_hex(0x888888), 0);
    lv_label_set_text(msg, "Video playback is limited on ESP32.\n"
                          "Consider using external video decoding\n"
                          "or converting to supported formats.");
    
    ESP_LOGI(TAG, "VideoPlayer initialized");
}

bool VideoPlayer::Open(const std::string& path) {
    current_file_ = path;
    
    // Extract filename
    const char* filename = strrchr(path.c_str(), '/');
    filename = filename ? filename + 1 : path.c_str();
    lv_label_set_text(title_label_, filename);
    lv_label_set_text(info_label_, filename);
    
    // Show player
    lv_obj_clear_flag(container_, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(container_);
    is_visible_ = true;
    
    ESP_LOGI(TAG, "Opened video file: %s", path.c_str());
    return true;
}

void VideoPlayer::Close() {
    FileViewer::Close();
}
